# WireTypeSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireTypeSet Constructor
WireTypeSet Class See Also
---
Initializes a new instance of the WireTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WireTypeSet()
```

# See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace